{
  "backend/main.mo": "Main Motoko canister defining data models, storage maps, authorization mixins, branding config, and Stripe initialization logic.",
  "feature_evidence.json": "Feature evidence report mapping copy‑link feature IDs to the frontend files and components implementing them.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend TypeScript/React file in the project.",
  "frontend/index.css": "Tailwind base/theme configuration defining CSS variables for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Root React routing configuration using TanStack Router with layouts, routes, profile setup dialog, and theme/notification providers.",
  "frontend/src/components/admin/AdminBrandingManager.tsx": "Provides an admin interface to view, edit, validate, and submit branding settings including images, social links, and language configuration.",
  "frontend/src/components/admin/AdminProductsManager.tsx": "Displays products and allows admins to create and delete products using a modal form.",
  "frontend/src/components/admin/AdminServicesManager.tsx": "Lists existing services and provides UI for creating and deleting services through a dialog form.",
  "frontend/src/components/admin/BrandingImageUrlListField.tsx": "Reusable component for editing a list of image URLs with previews, error handling, and add/remove controls.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "Form for viewing Stripe configuration status and updating secret key and allowed countries.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and loading state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog requiring new users to enter and save their name before proceeding.",
  "frontend/src/components/auth/RequireAuth.tsx": "No summary available.",
  "frontend/src/components/branding/BrandingBanner.tsx": "No summary available.",
  "frontend/src/components/branding/BrandingCarousel.tsx": "No summary available.",
  "frontend/src/components/checkout/StartCheckoutButton.tsx": "No summary available.",
  "frontend/src/components/Footer.tsx": "Simple footer component showing copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Main header with navigation, social links, language selector, cart indicator, auth controls, and a copy‑link button using clipboard + toast.",
  "frontend/src/components/layouts/AdminLayout.tsx": "No summary available.",
  "frontend/src/components/layouts/CustomerLayout.tsx": "No summary available.",
  "frontend/src/hooks/useActor.ts": "No summary available.",
  "frontend/src/hooks/useAdmin.ts": "No summary available.",
  "frontend/src/hooks/useAdminProducts.ts": "No summary available.",
  "frontend/src/hooks/useAdminServices.ts": "No summary available.",
  "frontend/src/hooks/useBranding.ts": "No summary available.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/hooks/useLanguagePreference.ts": "Manages language selection using site branding and localStorage, providing the current and available languages.",
  "frontend/src/hooks/useOrders.ts": "Fetches caller orders and provides a mutation to create new orders with automatic cache invalidation.",
  "frontend/src/hooks/useProducts.ts": "Retrieves the list of products from the actor when available.",
  "frontend/src/hooks/useServices.ts": "Fetches available service items from the actor.",
  "frontend/src/hooks/useStripeCheckout.ts": "Creates Stripe checkout sessions by calling the backend and validating the returned session.",
  "frontend/src/hooks/useStripeConfig.ts": "Checks if Stripe is configured and provides a mutation to update Stripe settings with cache refresh.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AccountPage.tsx": "Displays the authenticated user's profile and order history with loading states.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with tabs for managing services, products, branding, and payment settings.",
  "frontend/src/pages/CartPage.tsx": "Shows cart contents with quantity controls, item removal, and a link to checkout or store browsing.",
  "frontend/src/pages/CheckoutPage.tsx": "Provides an authenticated checkout summary with total calculation and a checkout initiation button.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with branding assets, hero section, and feature highlights linking to services and store.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment cancellation message with links back to the cart or store.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a payment success message, clears the cart, and offers links to orders or the store.",
  "frontend/src/pages/ProductDetailPage.tsx": "Fetches and displays detailed product info with add‑to‑cart and navigation options.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows detailed service information with pricing, description, and a contact prompt.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all services with loading skeletons and links to individual service pages.",
  "frontend/src/pages/StorePage.tsx": "Displays a product grid with branding banners, loading states, and add‑to‑cart actions.",
  "frontend/src/state/cart.ts": "Zustand store managing cart items with add, remove, update, clear, and total calculation logic.",
  "frontend/src/utils/copyToClipboard.ts": "Provides a safe clipboard copy function using the Clipboard API with a textarea fallback and error-handled boolean result.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, storing/retrieving them in sessionStorage, and handling hash-based routing with persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, container settings, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "JSON file describing the project's current state, versioning, core features, and architectural notes for the business app."
}